Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GB110.h
#define _PMMODE_MODE_POSITION                    0x00000008
#define _PMMODE_MODE_MASK                        0x00000300
#define _PMMODE_MODE_LENGTH                      0x00000002

#define _PMMODE_INCM0_POSITION                   0x0000000B
#define _PMMODE_INCM0_MASK                       0x00000800
#define _PMMODE_INCM0_LENGTH                     0x00000001

#define _PMMODE_INCM1_POSITION                   0x0000000C
#define _PMMODE_INCM1_MASK                       0x00001000
#define _PMMODE_INCM1_LENGTH                     0x00000001

#define _PMMODE_IRQM0_POSITION                   0x0000000D
#define _PMMODE_IRQM0_MASK                       0x00002000
#define _PMMODE_IRQM0_LENGTH                     0x00000001

#define _PMMODE_IRQM1_POSITION                   0x0000000E
#define _PMMODE_IRQM1_MASK                       0x00004000
#define _PMMODE_IRQM1_LENGTH                     0x00000001

#define _PMADDR_ADDR_POSITION                    0x00000000
#define _PMADDR_ADDR_MASK                        0x00003FFF
#define _PMADDR_ADDR_LENGTH                      0x0000000E

#define _PMADDR_CS_POSITION                      0x0000000E
#define _PMADDR_CS_MASK                          0x0000C000
#define _PMADDR_CS_LENGTH                        0x00000002

#define _PMADDR_ADDR0_POSITION                   0x00000000
#define _PMADDR_ADDR0_MASK                       0x00000001
#define _PMADDR_ADDR0_LENGTH                     0x00000001

#define _PMADDR_ADDR1_POSITION                   0x00000001
#define _PMADDR_ADDR1_MASK                       0x00000002
#define _PMADDR_ADDR1_LENGTH                     0x00000001

#define _PMADDR_ADDR2_POSITION                   0x00000002
#define _PMADDR_ADDR2_MASK                       0x00000004
#define _PMADDR_ADDR2_LENGTH                     0x00000001

#define _PMADDR_ADDR3_POSITION                   0x00000003
#define _PMADDR_ADDR3_MASK                       0x00000008
#define _PMADDR_ADDR3_LENGTH                     0x00000001

#define _PMADDR_ADDR4_POSITION                   0x00000004
#define _PMADDR_ADDR4_MASK                       0x00000010
#define _PMADDR_ADDR4_LENGTH                     0x00000001

#define _PMADDR_ADDR5_POSITION                   0x00000005
#define _PMADDR_ADDR5_MASK                       0x00000020
#define _PMADDR_ADDR5_LENGTH                     0x00000001

#define _PMADDR_ADDR6_POSITION                   0x00000006
#define _PMADDR_ADDR6_MASK                       0x00000040
#define _PMADDR_ADDR6_LENGTH                     0x00000001

#define _PMADDR_ADDR7_POSITION                   0x00000007
#define _PMADDR_ADDR7_MASK                       0x00000080
#define _PMADDR_ADDR7_LENGTH                     0x00000001

#define _PMADDR_ADDR8_POSITION                   0x00000008
#define _PMADDR_ADDR8_MASK                       0x00000100
#define _PMADDR_ADDR8_LENGTH                     0x00000001

#define _PMADDR_ADDR9_POSITION                   0x00000009
#define _PMADDR_ADDR9_MASK                       0x00000200
#define _PMADDR_ADDR9_LENGTH                     0x00000001

#define _PMADDR_ADDR10_POSITION                  0x0000000A
#define _PMADDR_ADDR10_MASK                      0x00000400
#define _PMADDR_ADDR10_LENGTH                    0x00000001

#define _PMADDR_ADDR11_POSITION                  0x0000000B
#define _PMADDR_ADDR11_MASK                      0x00000800
#define _PMADDR_ADDR11_LENGTH                    0x00000001

#define _PMADDR_ADDR12_POSITION                  0x0000000C
#define _PMADDR_ADDR12_MASK                      0x00001000
#define _PMADDR_ADDR12_LENGTH                    0x00000001

#define _PMADDR_ADDR13_POSITION                  0x0000000D
#define _PMADDR_ADDR13_MASK                      0x00002000
#define _PMADDR_ADDR13_LENGTH                    0x00000001

#define _PMADDR_CS1_POSITION                     0x0000000E
#define _PMADDR_CS1_MASK                         0x00004000
#define _PMADDR_CS1_LENGTH                       0x00000001

#define _PMADDR_CS2_POSITION                     0x0000000F
#define _PMADDR_CS2_MASK                         0x00008000
#define _PMADDR_CS2_LENGTH                       0x00000001

#define _PMDOUT1_ADDR_POSITION                   0x00000000
#define _PMDOUT1_ADDR_MASK                       0x00003FFF
#define _PMDOUT1_ADDR_LENGTH                     0x0000000E

#define _PMDOUT1_CS_POSITION                     0x0000000E
#define _PMDOUT1_CS_MASK                         0x0000C000
#define _PMDOUT1_CS_LENGTH                       0x00000002

#define _PMDOUT1_ADDR0_POSITION                  0x00000000
#define _PMDOUT1_ADDR0_MASK                      0x00000001
#define _PMDOUT1_ADDR0_LENGTH                    0x00000001

#define _PMDOUT1_ADDR1_POSITION                  0x00000001
#define _PMDOUT1_ADDR1_MASK                      0x00000002
#define _PMDOUT1_ADDR1_LENGTH                    0x00000001

#define _PMDOUT1_ADDR2_POSITION                  0x00000002
#define _PMDOUT1_ADDR2_MASK                      0x00000004
#define _PMDOUT1_ADDR2_LENGTH                    0x00000001

#define _PMDOUT1_ADDR3_POSITION                  0x00000003
#define _PMDOUT1_ADDR3_MASK                      0x00000008
#define _PMDOUT1_ADDR3_LENGTH                    0x00000001

#define _PMDOUT1_ADDR4_POSITION                  0x00000004
#define _PMDOUT1_ADDR4_MASK                      0x00000010
#define _PMDOUT1_ADDR4_LENGTH                    0x00000001

#define _PMDOUT1_ADDR5_POSITION                  0x00000005
#define _PMDOUT1_ADDR5_MASK                      0x00000020
#define _PMDOUT1_ADDR5_LENGTH                    0x00000001

#define _PMDOUT1_ADDR6_POSITION                  0x00000006
#define _PMDOUT1_ADDR6_MASK                      0x00000040
#define _PMDOUT1_ADDR6_LENGTH                    0x00000001

#define _PMDOUT1_ADDR7_POSITION                  0x00000007
#define _PMDOUT1_ADDR7_MASK                      0x00000080
#define _PMDOUT1_ADDR7_LENGTH                    0x00000001

#define _PMDOUT1_ADDR8_POSITION                  0x00000008
#define _PMDOUT1_ADDR8_MASK                      0x00000100
#define _PMDOUT1_ADDR8_LENGTH                    0x00000001

#define _PMDOUT1_ADDR9_POSITION                  0x00000009
#define _PMDOUT1_ADDR9_MASK                      0x00000200
#define _PMDOUT1_ADDR9_LENGTH                    0x00000001

#define _PMDOUT1_ADDR10_POSITION                 0x0000000A
#define _PMDOUT1_ADDR10_MASK                     0x00000400
#define _PMDOUT1_ADDR10_LENGTH                   0x00000001

#define _PMDOUT1_ADDR11_POSITION                 0x0000000B
#define _PMDOUT1_ADDR11_MASK                     0x00000800
#define _PMDOUT1_ADDR11_LENGTH                   0x00000001

#define _PMDOUT1_ADDR12_POSITION                 0x0000000C
#define _PMDOUT1_ADDR12_MASK                     0x00001000
#define _PMDOUT1_ADDR12_LENGTH                   0x00000001

#define _PMDOUT1_ADDR13_POSITION                 0x0000000D
#define _PMDOUT1_ADDR13_MASK                     0x00002000
#define _PMDOUT1_ADDR13_LENGTH                   0x00000001

#define _PMDOUT1_CS1_POSITION                    0x0000000E
#define _PMDOUT1_CS1_MASK                        0x00004000
#define _PMDOUT1_CS1_LENGTH                      0x00000001

#define _PMDOUT1_CS2_POSITION                    0x0000000F
#define _PMDOUT1_CS2_MASK                        0x00008000
#define _PMDOUT1_CS2_LENGTH                      0x00000001

#define _PMAEN_PTEN0_POSITION                    0x00000000
#define _PMAEN_PTEN0_MASK                        0x00000001
#define _PMAEN_PTEN0_LENGTH                      0x00000001

#define _PMAEN_PTEN1_POSITION                    0x00000001
#define _PMAEN_PTEN1_MASK                        0x00000002
#define _PMAEN_PTEN1_LENGTH                      0x00000001

#define _PMAEN_PTEN2_POSITION                    0x00000002
#define _PMAEN_PTEN2_MASK                        0x00000004
#define _PMAEN_PTEN2_LENGTH                      0x00000001

